microsoft/uf2-samdx1/lib/samd51/atdf/ATSAMD51G19A.atdf
        <register name="ADDR" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Address">
          <bitfield name="AMOD" caption="Access Mode" mask="0x3"/>
          <bitfield name="ADDR" caption="Address" mask="0xFFFFFFFC"/>
        </register>
        <register name="LENGTH" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Length">
          <bitfield name="LENGTH" caption="Length" mask="0xFFFFFFFC"/>
        </register>
        <register name="DATA" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Data">
          <bitfield name="DATA" caption="Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="DCC" offset="0x10" rw="RW" size="4" count="2" initval="0x00000000" caption="Debug Communication Channel n">
          <bitfield name="DATA" caption="Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="DID" offset="0x18" rw="R" size="4" initval="0x60060007" caption="Device Identification">
          <bitfield name="DEVSEL" caption="Device Select" mask="0xFF"/>
          <bitfield name="REVISION" caption="Revision Number" mask="0xF00"/>
          <bitfield name="DIE" caption="Die Number" mask="0xF000"/>
          <bitfield name="SERIES" caption="Series" mask="0x3F0000" values="DSU_DID__SERIES"/>
          <bitfield name="FAMILY" caption="Family" mask="0xF800000" values="DSU_DID__FAMILY"/>
          <bitfield name="PROCESSOR" caption="Processor" mask="0xF0000000" values="DSU_DID__PROCESSOR"/>
        </register>
        <register name="CFG" offset="0x1C" rw="RW" size="4" initval="0x00000002" caption="Configuration">
          <bitfield name="LQOS" caption="Latency Quality Of Service" mask="0x3"/>
          <bitfield name="DCCDMALEVEL" caption="DMA Trigger Level" mask="0xC" values="DSU_CFG__DCCDMALEVEL"/>
          <bitfield name="ETBRAMEN" caption="Trace Control" mask="0x10"/>
        </register>
        <register name="MBCTRL" offset="0x40" rw="RW" size="4" initval="0x00000000" caption="MBIST Control">
          <bitfield name="SWRST" caption="MBIST Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="MBIST Enable" mask="0x2"/>
        </register>
        <register name="MBCONFIG" offset="0x44" rw="RW" size="4" initval="0x00000000" caption="MBIST Configuration">
          <bitfield name="ALGO" caption="MBIST Algorithm" mask="0x1F" values="DSU_MBCONFIG__ALGO"/>
          <bitfield name="DEFRDMARGIN" caption="Force Default Read Margin" mask="0x40"/>
          <bitfield name="DBG" caption="Enable Debug Mode" mask="0x80"/>
        </register>
        <register name="MBWORD" offset="0x48" rw="RW" size="4" initval="0x00000000" caption="MBIST Background Word">
          <bitfield name="DATA" caption="MBIST Background Word" mask="0xFFFFFFFF"/>
        </register>
        <register name="MBGSTAT" offset="0x4C" rw="RW" size="4" initval="0x00000000" caption="MBIST Global Status">
          <bitfield name="ALLDONE" caption="MBIST Completed" mask="0x1"/>
          <bitfield name="FAILED" caption="MBIST Failed" mask="0x2"/>
          <bitfield name="ERRINFO" caption="MBIST Error Info Present" mask="0x4"/>
          <bitfield name="CONFIGURED" caption="MBIST Configuration Sent" mask="0x8"/>
        </register>
        <register name="MBDFAIL" offset="0x50" rw="R" size="4" initval="0x00000000" caption="MBIST Fail Data">
          <bitfield name="DATA" caption="Error Data Read" mask="0xFFFFFFFF"/>
        </register>
        <register name="MBDEXP" offset="0x54" rw="R" size="4" initval="0x00000000" caption="MBIST Expected Data">
          <bitfield name="DATA" caption="Expected Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="MBAFAIL" offset="0x58" rw="R" size="4" initval="0x00000000" caption="MBIST Fail Address">
          <bitfield name="ADDR" caption="Error Address" mask="0x3FFF"/>
        </register>
        <register name="MBCONTEXT" offset="0x5C" rw="R" size="4" initval="0x00000000" caption="MBIST Fail Context">
          <bitfield name="SUBSTEP" caption="Algorithm Sub-step" mask="0x1F" values="DSU_MBCONTEXT__SUBSTEP"/>
          <bitfield name="STEP" caption="Algorithm Step" mask="0x3E0" values="DSU_MBCONTEXT__STEP"/>
          <bitfield name="PORT" caption="DPRAM Port Index" mask="0x400"/>
        </register>
        <register name="MBENABLE0" offset="0x60" rw="RW" size="4" initval="0x00000000" caption="MBIST Memory Enable 0">
          <bitfield name="ENABLE0" caption="Memory 0 MBIST Enable" mask="0x1"/>
          <bitfield name="ENABLE1" caption="Memory 1 MBIST Enable" mask="0x2"/>
          <bitfield name="ENABLE2" caption="Memory 2 MBIST Enable" mask="0x4"/>
          <bitfield name="ENABLE3" caption="Memory 3 MBIST Enable" mask="0x8"/>
          <bitfield name="ENABLE4" caption="Memory 4 MBIST Enable" mask="0x10"/>
          <bitfield name="ENABLE5" caption="Memory 5 MBIST Enable" mask="0x20"/>
          <bitfield name="ENABLE6" caption="Memory 6 MBIST Enable" mask="0x40"/>
          <bitfield name="ENABLE7" caption="Memory 7 MBIST Enable" mask="0x80"/>
          <bitfield name="ENABLE8" caption="Memory 8 MBIST Enable" mask="0x100"/>
          <bitfield name="ENABLE9" caption="Memory 9 MBIST Enable" mask="0x200"/>
          <bitfield name="ENABLE10" caption="Memory 10 MBIST Enable" mask="0x400"/>
          <bitfield name="ENABLE11" caption="Memory 11 MBIST Enable" mask="0x800"/>
          <bitfield name="ENABLE12" caption="Memory 12 MBIST Enable" mask="0x1000"/>
          <bitfield name="ENABLE13" caption="Memory 13 MBIST Enable" mask="0x2000"/>
          <bitfield name="ENABLE14" caption="Memory 14 MBIST Enable" mask="0x4000"/>
          <bitfield name="ENABLE15" caption="Memory 15 MBIST Enable" mask="0x8000"/>
          <bitfield name="ENABLE16" caption="Memory 16 MBIST Enable" mask="0x10000"/>
          <bitfield name="ENABLE17" caption="Memory 17 MBIST Enable" mask="0x20000"/>
          <bitfield name="ENABLE18" caption="Memory 18 MBIST Enable" mask="0x40000"/>
          <bitfield name="ENABLE19" caption="Memory 19 MBIST Enable" mask="0x80000"/>
          <bitfield name="ENABLE20" caption="Memory 20 MBIST Enable" mask="0x100000"/>
          <bitfield name="ENABLE21" caption="Memory 21 MBIST Enable" mask="0x200000"/>
          <bitfield name="ENABLE22" caption="Memory 22 MBIST Enable" mask="0x400000"/>
          <bitfield name="ENABLE23" caption="Memory 23 MBIST Enable" mask="0x800000"/>
          <bitfield name="ENABLE24" caption="Memory 24 MBIST Enable" mask="0x1000000"/>
          <bitfield name="ENABLE25" caption="Memory 25 MBIST Enable" mask="0x2000000"/>
          <bitfield name="ENABLE26" caption="Memory 26 MBIST Enable" mask="0x4000000"/>
          <bitfield name="ENABLE27" caption="Memory 27 MBIST Enable" mask="0x8000000"/>
          <bitfield name="ENABLE28" caption="Memory 28 MBIST Enable" mask="0x10000000"/>
        </register>
