microsoft/uf2-samdx1/lib/samd51/atdf/ATSAMD51G19A.atdf
        <register name="PID5" offset="0x1FD4" rw="R" size="4" initval="0x00000000" caption="Peripheral Identification 5">
        </register>
        <register name="PID6" offset="0x1FD8" rw="R" size="4" initval="0x00000000" caption="Peripheral Identification 6">
        </register>
        <register name="PID7" offset="0x1FDC" rw="R" size="4" initval="0x00000000" caption="Peripheral Identification 7">
        </register>
        <register name="PID0" offset="0x1FE0" rw="R" size="4" initval="0x000000D0" caption="Peripheral Identification 0">
          <bitfield name="PARTNBL" caption="Part Number Low" mask="0xFF"/>
        </register>
        <register name="PID1" offset="0x1FE4" rw="R" size="4" initval="0x000000FC" caption="Peripheral Identification 1">
          <bitfield name="PARTNBH" caption="Part Number High" mask="0xF"/>
          <bitfield name="JEPIDCL" caption="Low part of the JEP-106 Identity Code" mask="0xF0"/>
        </register>
        <register name="PID2" offset="0x1FE8" rw="R" size="4" initval="0x00000009" caption="Peripheral Identification 2">
          <bitfield name="JEPIDCH" caption="JEP-106 Identity Code High" mask="0x7"/>
          <bitfield name="JEPU" caption="JEP-106 Identity Code is used" mask="0x8"/>
          <bitfield name="REVISION" caption="Revision Number" mask="0xF0"/>
        </register>
        <register name="PID3" offset="0x1FEC" rw="R" size="4" initval="0x00000000" caption="Peripheral Identification 3">
          <bitfield name="CUSMOD" caption="ARM CUSMOD" mask="0xF"/>
          <bitfield name="REVAND" caption="Revision Number" mask="0xF0"/>
        </register>
        <register name="CID0" offset="0x1FF0" rw="R" size="4" initval="0x0000000D" caption="Component Identification 0">
          <bitfield name="PREAMBLEB0" caption="Preamble Byte 0" mask="0xFF"/>
        </register>
        <register name="CID1" offset="0x1FF4" rw="R" size="4" initval="0x00000010" caption="Component Identification 1">
          <bitfield name="PREAMBLE" caption="Preamble" mask="0xF"/>
          <bitfield name="CCLASS" caption="Component Class" mask="0xF0"/>
        </register>
        <register name="CID2" offset="0x1FF8" rw="R" size="4" initval="0x00000005" caption="Component Identification 2">
          <bitfield name="PREAMBLEB2" caption="Preamble Byte 2" mask="0xFF"/>
        </register>
        <register name="CID3" offset="0x1FFC" rw="R" size="4" initval="0x000000B1" caption="Component Identification 3">
          <bitfield name="PREAMBLEB3" caption="Preamble Byte 3" mask="0xFF"/>
        </register>
      </register-group>
      <value-group name="DSU_DID__FAMILY">
        <value name="0" caption="General purpose microcontroller" value="0"/>
        <value name="1" caption="PicoPower" value="1"/>
      </value-group>
      <value-group name="DSU_DID__PROCESSOR">
        <value name="CM0P" caption="Cortex-M0+" value="0x1"/>
        <value name="CM23" caption="Cortex-M23" value="0x2"/>
        <value name="CM3" caption="Cortex-M3" value="0x3"/>
        <value name="CM4" caption="Cortex-M4" value="0x5"/>
        <value name="CM4F" caption="Cortex-M4 with FPU" value="0x6"/>
        <value name="CM33" caption="Cortex-M33" value="0x7"/>
      </value-group>
      <value-group name="DSU_DID__SERIES">
        <value name="0" caption="Cortex-M0+ processor, basic feature set" value="0"/>
        <value name="1" caption="Cortex-M0+ processor, USB" value="1"/>
      </value-group>
      <value-group name="DSU_CFG__DCCDMALEVEL">
        <value name="EMPTY" caption="Trigger rises when DCC is empty" value="0"/>
        <value name="FULL" caption="Trigger rises when DCC is full" value="1"/>
      </value-group>
      <value-group name="DSU_MBCONFIG__ALGO">
        <value name="MEMCLEAR" caption="Memory Clear (1n)" value="0x00"/>
        <value name="VERIFY" caption="Memory Verify (1n)" value="0x01"/>
        <value name="CLEARVER" caption="Memory Clear and Verify (2n)" value="0x02"/>
        <value name="ADDR_DEC" caption="Address Decoder (2n)" value="0x03"/>
        <value name="MARCH_LR" caption="March LR (14n)" value="0x04"/>
        <value name="MARCH_SR" caption="March SR (14n)" value="0x05"/>
        <value name="MARCH_SS" caption="March SS (22n)" value="0x06"/>
        <value name="CRC_UP" caption="CRC increasing address (1n)" value="0x08"/>
        <value name="CRC_DOWN" caption="CRC decreasing address (1n)" value="0x09"/>
      </value-group>
      <value-group name="DSU_MBCONTEXT__STEP">
        <value name="DOWN_R0W1" value="0x2"/>
        <value name="UP_R1W0R0W1" value="0x3"/>
        <value name="UP_R1W0" value="0x4"/>
        <value name="UP_R0W1R1W0" value="0x5"/>
        <value name="UP_R0" value="0x6"/>
        <value name="UP_R0R0W0R0W1" value="0x7"/>
        <value name="UP_R1R1W1R1W0" value="0x8"/>
        <value name="DOWN_R0R0W0R0W1" value="0x9"/>
        <value name="DOWN_R1R1W1R1W0" value="0xA"/>
        <value name="UP_R0R0" value="0xC"/>
        <value name="DOWN_R1W0R0W1" value="0xE"/>
        <value name="DOWN_R1R1" value="0xF"/>
      </value-group>
      <value-group name="DSU_MBCONTEXT__SUBSTEP">
        <value name="R0_1" value="0x1"/>
        <value name="R1_1" value="0x3"/>
        <value name="R0_2" value="0x5"/>
        <value name="R1_2" value="0x7"/>
        <value name="R0_3" value="0x9"/>
        <value name="R1_3" value="0xB"/>
      </value-group>
    </module>
    <module name="EIC" id="U2254" version="3.0.0" caption="External Interrupt Controller">
      <register-group name="EIC" caption="External Interrupt Controller">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="CKSEL" caption="Clock Selection" mask="0x10"/>
        </register>
        <register name="NMICTRL" offset="0x1" rw="RW" size="1" initval="0x00" caption="Non-Maskable Interrupt Control">
          <bitfield name="NMISENSE" caption="Non-Maskable Interrupt Sense Configuration" mask="0x7" values="EIC_NMICTRL__NMISENSE"/>
          <bitfield name="NMIFILTEN" caption="Non-Maskable Interrupt Filter Enable" mask="0x8"/>
          <bitfield name="NMIASYNCH" caption="Asynchronous Edge Detection Mode" mask="0x10"/>
        </register>
        <register name="NMIFLAG" offset="0x2" rw="RW" size="2" atomic-op="clear:NMIFLAG" initval="0x0000" caption="Non-Maskable Interrupt Flag Status and Clear">
          <bitfield name="NMI" caption="Non-Maskable Interrupt" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x4" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy Status" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Synchronization Busy Status" mask="0x2"/>
        </register>
        <register name="EVCTRL" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Event Control">
          <bitfield name="EXTINTEO" caption="External Interrupt Event Output Enable" mask="0xFFFF"/>
        </register>
        <register name="INTENCLR" offset="0xC" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="EXTINT" caption="External Interrupt Enable" mask="0xFFFF"/>
        </register>
