microsoft/uf2-samdx1/lib/samd51/atdf/ATSAMD51G19A.atdf
      <value-group name="ICM_RCFG__BEIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__CDWBN">
        <value name="WRBA" value="0"/>
        <value name="COMP" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__DMIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__ECIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__EOM">
        <value name="NO" value="0"/>
        <value name="YES" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__PROCDLY">
        <value name="SHORT" value="0"/>
        <value name="LONG" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__RHIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__SUIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__WCIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__WRAP">
        <value name="NO" value="0"/>
        <value name="YES" value="1"/>
      </value-group>
      <value-group name="ICM_UASR__URAT">
        <value name="UNSPEC_STRUCT_MEMBER" caption="Unspecified structure member set to one detected when the descriptor is loaded" value="0x0"/>
        <value name="CFG_MODIFIED" caption="CFG modified during active monitoring" value="0x1"/>
        <value name="DSCR_MODIFIED" caption="DSCR modified during active monitoring" value="0x2"/>
        <value name="HASH_MODIFIED" caption="HASH modified during active monitoring" value="0x3"/>
        <value name="READ_ACCESS" caption="Write-only register read access" value="0x4"/>
      </value-group>
    </module>
    <module name="MCLK" id="U2408" version="1.0.0" caption="Main Clock">
      <register-group name="MCLK" caption="Main Clock">
        <register name="INTENCLR" offset="0x1" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x2" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x3" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x01" caption="Interrupt Flag Status and Clear">
          <bitfield name="CKRDY" caption="Clock Ready" mask="0x1"/>
        </register>
        <register name="HSDIV" offset="0x4" rw="R" size="1" initval="0x01" caption="HS Clock Division">
          <bitfield name="DIV" caption="CPU Clock Division Factor" mask="0xFF" values="MCLK_HSDIV__DIV"/>
        </register>
        <register name="CPUDIV" offset="0x5" rw="RW" size="1" initval="0x01" caption="CPU Clock Division">
          <bitfield name="DIV" caption="Low-Power Clock Division Factor" mask="0xFF" values="MCLK_CPUDIV__DIV"/>
        </register>
        <register name="AHBMASK" offset="0x10" rw="RW" size="4" initval="0x00FFFFFF" caption="AHB Mask">
          <bitfield name="HPB0_" caption="HPB0 AHB Clock Mask" mask="0x1"/>
          <bitfield name="HPB1_" caption="HPB1 AHB Clock Mask" mask="0x2"/>
          <bitfield name="HPB2_" caption="HPB2 AHB Clock Mask" mask="0x4"/>
          <bitfield name="HPB3_" caption="HPB3 AHB Clock Mask" mask="0x8"/>
          <bitfield name="DSU_" caption="DSU AHB Clock Mask" mask="0x10"/>
          <bitfield name="HMATRIX_" caption="HMATRIX AHB Clock Mask" mask="0x20"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL AHB Clock Mask" mask="0x40"/>
          <bitfield name="HSRAM_" caption="HSRAM AHB Clock Mask" mask="0x80"/>
          <bitfield name="CMCC_" caption="CMCC AHB Clock Mask" mask="0x100"/>
          <bitfield name="DMAC_" caption="DMAC AHB Clock Mask" mask="0x200"/>
          <bitfield name="USB_" caption="USB AHB Clock Mask" mask="0x400"/>
          <bitfield name="BKUPRAM_" caption="BKUPRAM AHB Clock Mask" mask="0x800"/>
          <bitfield name="PAC_" caption="PAC AHB Clock Mask" mask="0x1000"/>
          <bitfield name="QSPI_" caption="QSPI AHB Clock Mask" mask="0x2000"/>
          <bitfield name="SDHC0_" caption="SDHC0 AHB Clock Mask" mask="0x8000"/>
          <bitfield name="ICM_" caption="ICM AHB Clock Mask" mask="0x80000"/>
          <bitfield name="PUKCC_" caption="PUKCC AHB Clock Mask" mask="0x100000"/>
          <bitfield name="QSPI_2X_" caption="QSPI_2X AHB Clock Mask" mask="0x200000"/>
          <bitfield name="NVMCTRL_SMEEPROM_" caption="NVMCTRL_SMEEPROM AHB Clock Mask" mask="0x400000"/>
          <bitfield name="NVMCTRL_CACHE_" caption="NVMCTRL_CACHE AHB Clock Mask" mask="0x800000"/>
        </register>
        <register name="APBAMASK" offset="0x14" rw="RW" size="4" initval="0x000007FF" caption="APBA Mask">
          <bitfield name="PAC_" caption="PAC APB Clock Enable" mask="0x1"/>
          <bitfield name="PM_" caption="PM APB Clock Enable" mask="0x2"/>
          <bitfield name="MCLK_" caption="MCLK APB Clock Enable" mask="0x4"/>
          <bitfield name="RSTC_" caption="RSTC APB Clock Enable" mask="0x8"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL APB Clock Enable" mask="0x10"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL APB Clock Enable" mask="0x20"/>
          <bitfield name="SUPC_" caption="SUPC APB Clock Enable" mask="0x40"/>
          <bitfield name="GCLK_" caption="GCLK APB Clock Enable" mask="0x80"/>
          <bitfield name="WDT_" caption="WDT APB Clock Enable" mask="0x100"/>
          <bitfield name="RTC_" caption="RTC APB Clock Enable" mask="0x200"/>
          <bitfield name="EIC_" caption="EIC APB Clock Enable" mask="0x400"/>
          <bitfield name="FREQM_" caption="FREQM APB Clock Enable" mask="0x800"/>
          <bitfield name="SERCOM0_" caption="SERCOM0 APB Clock Enable" mask="0x1000"/>
          <bitfield name="SERCOM1_" caption="SERCOM1 APB Clock Enable" mask="0x2000"/>
          <bitfield name="TC0_" caption="TC0 APB Clock Enable" mask="0x4000"/>
          <bitfield name="TC1_" caption="TC1 APB Clock Enable" mask="0x8000"/>
        </register>
