microsoft/uf2-samdx1/lib/samd51/atdf/ATSAMD51G19A.atdf
        <register name="DPLLRATIO" offset="0x4" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="DPLL Ratio Control">
          <bitfield name="LDR" caption="Loop Divider Ratio" mask="0x1FFF"/>
          <bitfield name="LDRFRAC" caption="Loop Divider Ratio Fractional Part" mask="0x1F0000"/>
        </register>
        <register name="DPLLCTRLB" offset="0x8" rw="RW" size="4" initval="0x00000020" caption="DPLL Control B">
          <bitfield name="FILTER" caption="Proportional Integral Filter Selection" mask="0xF"/>
          <bitfield name="WUF" caption="Wake Up Fast" mask="0x10"/>
          <bitfield name="REFCLK" caption="Reference Clock Selection" mask="0xE0" values="OSCCTRL_DPLLCTRLB__REFCLK"/>
          <bitfield name="LTIME" caption="Lock Time" mask="0x700" values="OSCCTRL_DPLLCTRLB__LTIME"/>
          <bitfield name="LBYPASS" caption="Lock Bypass" mask="0x800"/>
          <bitfield name="DCOFILTER" caption="Sigma-Delta DCO Filter Selection" mask="0x7000"/>
          <bitfield name="DCOEN" caption="DCO Filter Enable" mask="0x8000"/>
          <bitfield name="DIV" caption="Clock Divider" mask="0x7FF0000"/>
        </register>
        <register name="DPLLSYNCBUSY" offset="0xC" rw="R" size="4" initval="0x00000000" caption="DPLL Synchronization Busy">
          <bitfield name="ENABLE" caption="DPLL Enable Synchronization Status" mask="0x2"/>
          <bitfield name="DPLLRATIO" caption="DPLL Loop Divider Ratio Synchronization Status" mask="0x4"/>
        </register>
        <register name="DPLLSTATUS" offset="0x10" rw="R" size="4" initval="0x00000000" caption="DPLL Status">
          <bitfield name="LOCK" caption="DPLL Lock Status" mask="0x1"/>
          <bitfield name="CLKRDY" caption="DPLL Clock Ready" mask="0x2"/>
        </register>
      </register-group>
      <register-group name="OSCCTRL" caption="Oscillators Control">
        <register name="EVCTRL" offset="0x0" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="CFDEO0" caption="Clock 0 Failure Detector Event Output Enable" mask="0x1"/>
          <bitfield name="CFDEO1" caption="Clock 1 Failure Detector Event Output Enable" mask="0x2"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="XOSCRDY0" caption="XOSC 0 Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="XOSCRDY1" caption="XOSC 1 Ready Interrupt Enable" mask="0x2"/>
          <bitfield name="XOSCFAIL0" caption="XOSC 0 Clock Failure Detector Interrupt Enable" mask="0x4"/>
          <bitfield name="XOSCFAIL1" caption="XOSC 1 Clock Failure Detector Interrupt Enable" mask="0x8"/>
          <bitfield name="DFLLRDY" caption="DFLL Ready Interrupt Enable" mask="0x100"/>
          <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds Interrupt Enable" mask="0x200"/>
          <bitfield name="DFLLLCKF" caption="DFLL Lock Fine Interrupt Enable" mask="0x400"/>
          <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse Interrupt Enable" mask="0x800"/>
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped Interrupt Enable" mask="0x1000"/>
          <bitfield name="DPLL0LCKR" caption="DPLL0 Lock Rise Interrupt Enable" mask="0x10000"/>
          <bitfield name="DPLL0LCKF" caption="DPLL0 Lock Fall Interrupt Enable" mask="0x20000"/>
          <bitfield name="DPLL0LTO" caption="DPLL0 Lock Timeout Interrupt Enable" mask="0x40000"/>
          <bitfield name="DPLL0LDRTO" caption="DPLL0 Loop Divider Ratio Update Complete Interrupt Enable" mask="0x80000"/>
          <bitfield name="DPLL1LCKR" caption="DPLL1 Lock Rise Interrupt Enable" mask="0x1000000"/>
          <bitfield name="DPLL1LCKF" caption="DPLL1 Lock Fall Interrupt Enable" mask="0x2000000"/>
          <bitfield name="DPLL1LTO" caption="DPLL1 Lock Timeout Interrupt Enable" mask="0x4000000"/>
          <bitfield name="DPLL1LDRTO" caption="DPLL1 Loop Divider Ratio Update Complete Interrupt Enable" mask="0x8000000"/>
        </register>
        <register name="INTENSET" offset="0x8" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="XOSCRDY0" caption="XOSC 0 Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="XOSCRDY1" caption="XOSC 1 Ready Interrupt Enable" mask="0x2"/>
          <bitfield name="XOSCFAIL0" caption="XOSC 0 Clock Failure Detector Interrupt Enable" mask="0x4"/>
          <bitfield name="XOSCFAIL1" caption="XOSC 1 Clock Failure Detector Interrupt Enable" mask="0x8"/>
          <bitfield name="DFLLRDY" caption="DFLL Ready Interrupt Enable" mask="0x100"/>
          <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds Interrupt Enable" mask="0x200"/>
          <bitfield name="DFLLLCKF" caption="DFLL Lock Fine Interrupt Enable" mask="0x400"/>
          <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse Interrupt Enable" mask="0x800"/>
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped Interrupt Enable" mask="0x1000"/>
          <bitfield name="DPLL0LCKR" caption="DPLL0 Lock Rise Interrupt Enable" mask="0x10000"/>
          <bitfield name="DPLL0LCKF" caption="DPLL0 Lock Fall Interrupt Enable" mask="0x20000"/>
          <bitfield name="DPLL0LTO" caption="DPLL0 Lock Timeout Interrupt Enable" mask="0x40000"/>
          <bitfield name="DPLL0LDRTO" caption="DPLL0 Loop Divider Ratio Update Complete Interrupt Enable" mask="0x80000"/>
          <bitfield name="DPLL1LCKR" caption="DPLL1 Lock Rise Interrupt Enable" mask="0x1000000"/>
          <bitfield name="DPLL1LCKF" caption="DPLL1 Lock Fall Interrupt Enable" mask="0x2000000"/>
          <bitfield name="DPLL1LTO" caption="DPLL1 Lock Timeout Interrupt Enable" mask="0x4000000"/>
          <bitfield name="DPLL1LDRTO" caption="DPLL1 Loop Divider Ratio Update Complete Interrupt Enable" mask="0x8000000"/>
        </register>
        <register name="INTFLAG" offset="0xC" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="XOSCRDY0" caption="XOSC 0 Ready" mask="0x1"/>
          <bitfield name="XOSCRDY1" caption="XOSC 1 Ready" mask="0x2"/>
          <bitfield name="XOSCFAIL0" caption="XOSC 0 Clock Failure Detector" mask="0x4"/>
          <bitfield name="XOSCFAIL1" caption="XOSC 1 Clock Failure Detector" mask="0x8"/>
          <bitfield name="DFLLRDY" caption="DFLL Ready" mask="0x100"/>
          <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds" mask="0x200"/>
          <bitfield name="DFLLLCKF" caption="DFLL Lock Fine" mask="0x400"/>
          <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse" mask="0x800"/>
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped" mask="0x1000"/>
          <bitfield name="DPLL0LCKR" caption="DPLL0 Lock Rise" mask="0x10000"/>
          <bitfield name="DPLL0LCKF" caption="DPLL0 Lock Fall" mask="0x20000"/>
          <bitfield name="DPLL0LTO" caption="DPLL0 Lock Timeout" mask="0x40000"/>
          <bitfield name="DPLL0LDRTO" caption="DPLL0 Loop Divider Ratio Update Complete" mask="0x80000"/>
          <bitfield name="DPLL1LCKR" caption="DPLL1 Lock Rise" mask="0x1000000"/>
          <bitfield name="DPLL1LCKF" caption="DPLL1 Lock Fall" mask="0x2000000"/>
          <bitfield name="DPLL1LTO" caption="DPLL1 Lock Timeout" mask="0x4000000"/>
          <bitfield name="DPLL1LDRTO" caption="DPLL1 Loop Divider Ratio Update Complete" mask="0x8000000"/>
        </register>
        <register name="STATUS" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Status">
          <bitfield name="XOSCRDY0" caption="XOSC 0 Ready" mask="0x1"/>
          <bitfield name="XOSCRDY1" caption="XOSC 1 Ready" mask="0x2"/>
          <bitfield name="XOSCFAIL0" caption="XOSC 0 Clock Failure Detector" mask="0x4"/>
          <bitfield name="XOSCFAIL1" caption="XOSC 1 Clock Failure Detector" mask="0x8"/>
          <bitfield name="XOSCCKSW0" caption="XOSC 0 Clock Switch" mask="0x10"/>
          <bitfield name="XOSCCKSW1" caption="XOSC 1 Clock Switch" mask="0x20"/>
          <bitfield name="DFLLRDY" caption="DFLL Ready" mask="0x100"/>
          <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds" mask="0x200"/>
          <bitfield name="DFLLLCKF" caption="DFLL Lock Fine" mask="0x400"/>
          <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse" mask="0x800"/>
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped" mask="0x1000"/>
          <bitfield name="DPLL0LCKR" caption="DPLL0 Lock Rise" mask="0x10000"/>
          <bitfield name="DPLL0LCKF" caption="DPLL0 Lock Fall" mask="0x20000"/>
          <bitfield name="DPLL0TO" caption="DPLL0 Timeout" mask="0x40000"/>
          <bitfield name="DPLL0LDRTO" caption="DPLL0 Loop Divider Ratio Update Complete" mask="0x80000"/>
          <bitfield name="DPLL1LCKR" caption="DPLL1 Lock Rise" mask="0x1000000"/>
          <bitfield name="DPLL1LCKF" caption="DPLL1 Lock Fall" mask="0x2000000"/>
          <bitfield name="DPLL1TO" caption="DPLL1 Timeout" mask="0x4000000"/>
          <bitfield name="DPLL1LDRTO" caption="DPLL1 Loop Divider Ratio Update Complete" mask="0x8000000"/>
        </register>
        <register name="XOSCCTRL" offset="0x14" rw="RW" size="4" count="2" initval="0x00000080" caption="External Multipurpose Crystal Oscillator Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="XTALEN" caption="Crystal Oscillator Enable" mask="0x4"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="LOWBUFGAIN" caption="Low Buffer Gain Enable" mask="0x100"/>
          <bitfield name="IPTAT" caption="Oscillator Current Reference" mask="0x600"/>
          <bitfield name="IMULT" caption="Oscillator Current Multiplier" mask="0x7800"/>
          <bitfield name="ENALC" caption="Automatic Loop Control Enable" mask="0x8000"/>
          <bitfield name="CFDEN" caption="Clock Failure Detector Enable" mask="0x10000"/>
          <bitfield name="SWBEN" caption="Xosc Clock Switch Enable" mask="0x20000"/>
          <bitfield name="STARTUP" caption="Start-Up Time" mask="0xF00000"/>
          <bitfield name="CFDPRESC" caption="Clock Failure Detector Prescaler" mask="0xF000000"/>
        </register>
        <register name="DFLLCTRLA" offset="0x1C" rw="RW" size="1" initval="0x82" caption="DFLL48M Control A">
          <bitfield name="ENABLE" caption="DFLL Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
        </register>
